Console.Clear();

// // Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// // 3, 5 -> 243 (3⁵)
// // 2, 4 -> 16


Console.WriteLine("Задача 25");
Console.WriteLine();

Console.WriteLine("Введите первое число: ");
double A = Convert.ToDouble(Console.ReadLine());
Console.WriteLine("Введите второе число: ");
double B = Convert.ToDouble(Console.ReadLine());

double AB = Math.Pow(A,B);
Console.WriteLine(AB);

// ---------------------------------------------------------------------------------------------------------------------------

// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12


Console.WriteLine("Введите первое число: ");
int Q = Convert.ToInt32(Console.ReadLine());
int sum = 0;

while (Q > 0)
{
    sum = sum + Q % 10;
    Q = Q / 10;
}

Console.WriteLine($"Сумма = {sum}");

Console.WriteLine();




// // -----------------------------------------------------------------------------------------------------------

// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]

int[] array = new int[8] { 3, 4, 2, 3, 5, 1, 33, 1, };
Console.Write($"Массив:[{array[0]}, {array[1]}, {array[2]}," +
$" { array[3]}, { array[4]}, { array[5]}, " +
$"{ array[6]}, { array[7]}]");

